docs/summary-mysql-5.7.19.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET /api2/customers/ID,6352,25,5,87,"7,79","0,016%","81,63370","23,30","10,75","292,3"
POST /api2/orders,4285,58,19,183,"16,52","0,093%","55,05235","6,69","49,46","124,4"
GET /api2/products/ID,6395,25,6,92,"7,49","0,031%","82,19266","21,56","10,75","268,6"
GET /api2/orders/ID,6292,30,9,154,"9,30","0,048%","80,85117","39,41","10,35","499,2"
POST /api/customers,242,23,7,66,"8,24","0,000%","3,12274","0,37","0,88","122,0"
POST /api/products,233,24,11,105,"10,58","0,000%","3,01931","0,36","0,80","122,0"
TOTAL,23799,32,5,183,"15,92","0,042%","305,75433","91,66","82,97","307,0"