docs/summary-mysql-8.0.3.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET /api2/orders/ID,6497,30,7,112,"11,09","0,031%","75,42548","36,81","9,65","499,7"
GET /api2/customers/ID,6752,24,5,88,"9,16","0,044%","78,39313","22,43","10,32","293,0"
GET /api2/products/ID,6541,23,6,108,"8,94","0,000%","75,99452","19,88","9,94","267,8"
POST /api2/orders,4454,72,13,208,"22,10","0,112%","51,69812","6,31","46,44","124,9"
POST /api/customers,242,30,13,105,"12,78","0,000%","2,82018","0,34","0,79","122,0"
POST /api/products,252,29,12,69,"9,79","0,000%","2,99234","0,36","0,80","122,0"
TOTAL,24738,34,5,208,"22,05","0,040%","287,13699","86,07","77,91","306,9"