docs/summary-pgsql-10.0-alpine.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET /api2/orders/ID,6921,18,5,66,"5,69","0,029%","124,08340","60,40","15,88","498,4"
POST /api2/orders,4702,44,12,136,"11,22","0,064%","84,25013","10,17","75,72","123,7"
GET /api2/customers/ID,6988,14,3,50,"4,62","0,014%","125,30259","35,76","16,51","292,3"
GET /api2/products/ID,6982,14,3,53,"4,59","0,057%","125,19051","32,92","16,36","269,3"
POST /api/products,274,15,6,54,"5,73","0,000%","4,92451","0,59","1,31","122,0"
POST /api/customers,248,15,6,48,"5,42","0,000%","4,50557","0,54","1,27","122,0"
TOTAL,26115,21,3,136,"13,05","0,038%","467,91013","140,28","126,99","307,0"